Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--grass_overview.tmx
Source language: en
Languages: ja

source: Fully featured GIS
ja: フル機能のGIS

source: The Geographic Resources Analysis Support System, commonly referred to as GRASS, is a Geographic Information System (GIS) providing powerful raster, vector, and geospatial processing engines in a single integrated software suite. GRASS GIS includes tools for spatial modeling, visualization of raster and vector data, management and analysis of geospatial data, and the processing of satellite and aerial imagery. It comes with a temporal framework for advanced time series processing and a Python API for rapid geospatial programming. GRASS GIS has been optimized for performance and large geospatial data analysis. It also can produce sophisticated presentation graphics and hardcopy maps. GRASS GIS has been translated into many languages and supports a huge array of data formats.
ja: GRASS(Geographic Resources Analysis Support System)は、一般にGRASSと呼ばれる地理情報システム(GIS)で単一の統合ソフトウェアスイートで提供する地理情報システム(GIS)です。GRASS GISには、空間モデリング、ラスターおよびベクトルデータの視覚化、空間データの管理と分析、衛星および航空画像の処理のためのツールが含まれています。高度な時系列処理のための時間的フレームワークと、高速空間プログラミングのためのPython APIが付属しています。GRASS GISは、パフォーマンスおよび大規模な空間データ分析用に最適化されています。また、高度なプレゼンテーショングラフィックスやハードコピーマップを作成することもできます。GRASS GISは多くの言語に翻訳され、膨大なデータフォーマットをサポートしています。

source: GRASS GIS is used around the world in academic and commercial settings as well as by many governmental agencies and environmental consulting companies. It runs on a variety of popular hardware platforms and is Free open-source software released under the terms of the GNU General Public License.
ja: GRASS GISは、多くの政府機関や環境コンサルティング会社だけでなく、学術的および商業的な環境で世界中で使用されています。さまざまな一般的なハードウェアプラットフォーム上で動作し、GNU General Public Licenseの条件に基づいてリリースされたフリーのオープンソースソフトウェアです。

source: The GRASS GIS software includes more than 400 built-in analysis modules. Additionally, over 100 community supplied modules and toolboxes are available for free from the Add-on repository. After more than 30 years of continuous development GRASS GIS is both the longest maintained and largest Open Source GIS available. It is easily scriptable and versatile enough to be used both for batch data processing on massively-parallel supercomputers as well as a handy desktop GIS for handheld PDAs or netbooks.
ja: GRASS GISソフトウェアには、400以上の分析モジュールが組み込まれています。さらに、コミュニティが提供する100を超えるモジュールとツールボックスは、アドオンリポジトリから無償で利用できます。GRASS GISは、30年以上にわたって継続的に開発されてきたオープンソースGISの中で、最も長く維持され、かつ最大のものです。これは簡単にスクリプト化でき、超並列スーパーコンピュータ上でのバッチデータ処理にも、ハンドヘルドPDAやネットブック用の便利なデスクトップGISにも十分に使用できます。

source: Core Features
ja: 主要機能

source: You name it, there's a `tool for it <https://grass.osgeo.org/grass78/manuals/keywords.html>`_.
ja: 名前から逆引するための`ツールがあります <https://grass.osgeo.org/grass78/manuals/keywords.html>`_.

source: Explore the `screenshot collection <https://grass.osgeo.org/learn/gallery/>`_.
ja: `screenshot collection <https://grass.osgeo.org/learn/gallery/>`_をご覧ください。

source: Details
ja: 詳細

source: **Website:**
ja: **Webサイト:**

source: **Licence:** GNU General Public License (GPL) version 2+
ja: **ライセンス:** GNU General Public License (GPL) version 2+

source: **Software Version:** |version-grass|
ja: **ソフトウエアバージョン:** |version-grass|

source: **Supported Platforms:** GNU/Linux, Mac OSX, MS Windows
ja: **対応プラットフォーム:** GNU/Linux, Mac OSX, MS Windows

source: **API Interfaces:** C, Python, Bourne Shell
ja: **API インターフェイス:** C, Python, Bourne Shell

source: **Support:** https://grass.osgeo.org/about/community/
ja: **サポート:** https://grass.osgeo.org/about/community/

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/grass_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/grass_quickstart>`
